[{"BOOKMARK":false,"CATEGORIES":"Asian","INGREDIENTS":["1 teaspoon olive oil","2 carrots  cut into matchsticks","1 clove garlic  minced","1 pinch red pepper flakes","1 pound thinly-sliced beef top round steak","4 large eggs4 cups cooked white rice","4 teaspoons toasted sesame oil  divided","1 teaspoon sesame seeds","2 teaspoons gochujang (Korean hot pepper paste)  divided (optional)"],"IMG_URL":"http://www.kongsim.co.kr/upload/menu_01/2017_02_22/hero_ljtdP_2017_02_22_15_50_30.jpg","CAPTION":"Bi-bim-bap","_locals":{},"DIRECTIONS":["1. Stir cucumber pieces with 1/4 cup gochujang paste in a bowl; set aside.","2. Bring about 2 cups of water to a boil in a large nonstick skillet and stir in spinach; cook until spinach is bright green and wilted, 2 to 3 minutes. Drain spinach and squeeze out as much moisture as possible; set spinach aside in a bowl and stir soy sauce into spinach.","3. Heat 1 teaspoon olive oil in large nonstick skillet and cook and stir carrots until softened, about 3 minutes; stir in garlic and cook just until fragrant, about 1 more minute. Stir in cucumber pieces with gochujang paste; sprinkle with red pepper flakes, and set the mixture aside in a bowl.","4. Brown beef in a clean nonstick skillet over medium heat, about 5 minutes per side, and set aside. In a separate nonstick skillet, heat 1 more teaspoon olive oil over medium-low heat and fry the eggs just on one side until yolks are runny but whites are firm, 2 to 4 minutes each.","5. To assemble the dish, divide cooked rice into 4 large serving bowls; top with spinach mixture, a few pieces of beef, and cucumber mixture. Place 1 egg atop each serving. Drizzle each bowl with 1 teaspoon of sesame oil, a sprinkle of sesame seeds, and a small amount of gochujang paste if desired."]},{"BOOKMARK":false,"CATEGORIES":"Mexican","INGREDIENTS":[" ½ pounds skinless  boneless chicken breast meat - cubed","⅛ cup red wine vinegar","½ lime  juiced","1 teaspoon white sugar","½ teaspoon salt","½ teaspoon ground black pepper","2 green onions  chopped","2 cloves garlic  minced","1 teaspoon dried oregano","10 (6 inch) flour tortillas","1 tomato  diced","¼ cup shredded lettuce","¼ cup shredded Monterey Jack cheese","¼ cup salsa"],"IMG_URL":"https://www.jessicagavin.com/wp-content/uploads/2016/09/two-mahi-mahi-fish-taco-plate-with-avocado-lime-sauce-1200.jpg","CAPTION":"Lime Chicken Soft Tacos","_locals":{},"DIRECTIONS":["1. Saute chicken in a medium saucepan over medium high heat for about 20 minutes. Add vinegar, lime juice, sugar, salt, pepper, green onion, garlic and oregano. Simmer for an extra 10 minutes.","2. Heat an iron skillet over medium heat. Place a tortilla in the pan, warm, and turn over to heat the other side. Repeat with remaining tortillas. Serve lime chicken mixture in warm tortillas topped with tomato, lettuce, cheese and salsa."]},{"BOOKMARK":false,"CATEGORIES":"American","INGREDIENTS":["1 (12 ounce) sirloin steak","salt and freshly ground black pepper to taste","2 tablespoons oil  or as needed","1/3 cup shiitake mushrooms  stems discarded  caps thickly sliced","1/2 shallot  sliced","1 clove garlic  peeled","1/3 cup dry white wine","1/3 cup beef broth","1/4 cup butter  cubed","2 tablespoons chopped fresh tarragon "],"IMG_URL":"https://lh3.googleusercontent.com/proxy/WGmd0nX27AApPEXhO7IAoM35HXDeyrjoG6F8FCvEQ0FHx_wL0kpofvxBlRvtFs6UztSy_0yResigcdiCIR9H2FvbV_AUvKZWR6FIkNxWHnSWOWLZBHez-ZoX0lcCXDut0F0B8y7iF8m3IXhRpJewe8pZbX4Wh3TM5iWtOHxXxus-xXrFcg=s0-d","CAPTION":"Sirloin Steak with Mushrooms Pasta","_locals":{},"DIRECTIONS":["1. Season steak with salt and pepper on both sides.","2. Heat a heavy skillet over high heat until a drop of water immediately sizzles and evaporates when flicked onto the skillet's surface. Pour in oil. Add steak and cook until it is beginning to firm and is hot and slightly pink in the center, about 4 minutes per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C).","3. Remove steak from skillet and set aside. Tent with foil to keep warm. Discard oil remaining in the skillet.","4. Reduce heat to medium-low and cook mushrooms, shallot, and garlic, stirring frequently, until softened, about 5 minutes. Pour in white wine and cook until slightly reduced. Pour in beef broth. Reduce heat to low and stir in butter, 1 cube at a time, stirring well after each addition. Stir in tarragon. Season with salt and pepper. Serve mushroom sauce over the steak."]},{"BOOKMARK":false,"CATEGORIES":"Italian","INGREDIENTS":["1 pound bucatini pasta","1 (2 ounce) can anchovy fillets  oil reserved","1 teaspoon red pepper flakes  or to taste","3 cloves garlic  minced","2 zucchini  halved lengthwise and cut in 1/4 inch slices","1 pint grape tomatoes","2 teaspoons dried oregano","2 teaspoons dried basil","1 pound peeled and deveined medium shrimp"],"IMG_URL":"https://images.media-allrecipes.com/userphotos/600x600/6556979.jpg","CAPTION":"Shrimp Pasta","_locals":{},"DIRECTIONS":["1. Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.","2. Meanwhile, stir together the anchovies and their oil with the red pepper flakes and garlic in a large skillet over medium heat, breaking up the anchovies as you stir. Once the garlic begins to sizzle, add the sliced zucchini, and cook until it begins to soften, about 3 minutes. Stir in the grape tomatoes, and continue cooking until the zucchini is tender, and the skins of the tomatoes begin to pop, 5 minutes more.","3. Sprinkle the vegetable mixture with oregano and basil, then stir in shrimp. Cook until the shrimp turn pink and are no longer translucent. Pour over bucatini to serve."]},{"BOOKMARK":false,"CATEGORIES":"American","INGREDIENTS":["1/4 cup maple syrup","2 tablespoons soy sauce","1 clove garlic  minced","1/4 teaspoon garlic salt","1/8 teaspoon ground black pepper","1 pound salmon"],"IMG_URL":"https://vignette.wikia.nocookie.net/recipes/images/7/7c/Maplesalmon.jpg/revision/latest?cb=20131218002632","CAPTION":"Maple Salmon","_locals":{},"DIRECTIONS":["1. In a small bowl, mix the maple syrup, soy sauce, garlic, garlic salt, and pepper.","2. Place salmon in a shallow glass baking dish, and coat with the maple syrup mixture. Cover the dish, and marinate salmon in the refrigerator 30 minutes, turning once.","3. Preheat oven to 400 degrees F (200 degrees C).","4. Place the baking dish in the preheated oven, and bake salmon uncovered 20 minutes, or until easily flaked with a fork."]},{"BOOKMARK":false,"CATEGORIES":"Italian","INGREDIENTS":["1 lime","3 cloves garlic  minced","1 pound large fresh shrimp  peeled and deveined","3/4 cup chicken broth or chicken stock","1 medium orange bell pepper or red bell pepper  cut into 2-inch long strips","1 small onion  cut in half and sliced","1/4 cup chopped fresh cilantro leaves","4 cups romaine lettuce or iceberg lettuce  torn into bite-sized pieces","2 large tomatoes  thickly sliced","1/4 teaspoon ground black pepper"],"IMG_URL":"https://img1.coastalliving.timeinc.net/sites/default/files/image/2009/08/shrimp-salad-cl-1611640-x.jpg","CAPTION":"Margarita Shrimp Salad","_locals":{},"DIRECTIONS":["1. Grate 2 teaspoons zest and squeeze 1 tablespoon juice from the lime.","2. Stir the lime juice, lime zest, and garlic in a 2-quart shallow, nonmetallic baking dish or a gallon-size resealable plastic bag. Add the shrimp and toss to coat. Cover the dish or seal the bag and refrigerate for 30 minutes, turning the shrimp over several times during the marinating time.","3. Heat the broth in a 2-quart saucepan over medium-high heat to a boil. Add the pepper and onion and cook until the vegetables are tender-crisp, stirring occasionally.","4. Reduce the heat to medium. Add the shrimp and marinade to the saucepan and heat to a boil. Cook until the shrimp are cooked through. Stir in the cilantro.","5. Divide the lettuce, tomatoes and shrimp mixture among 4 serving plates. Season with the black pepper."]},{"BOOKMARK":false,"CATEGORIES":"American","INGREDIENTS":["1/2 cup butter","2/3 cup white sugar","2 eggs","1 cup buttermilk","1/2 teaspoon baking soda","1 cup cornmeal","1 cup all-purpose flour","1/2 teaspoon salt"],"IMG_URL":"https://www.tasteofhome.com/wp-content/uploads/2018/01/exps29167__TH163622B04_20_1b-696x696.jpg ","CAPTION":"Grandmother's Buttermilk Cornbread","_locals":{},"DIRECTIONS":["1. Preheat oven to 375 degrees F (175 degrees C). Grease an 8 inch square pan.","2. Melt butter in large skillet. Remove from heat and stir in sugar. Quickly add eggs and beat until well blended. Combine buttermilk with baking soda and stir into mixture in pan. Stir in cornmeal, flour, and salt until well blended and few lumps remain. Pour batter into the prepared pan.","3. Bake in the preheated oven for 30 to 40 minutes, or until a toothpick inserted in the center comes out clean."]},{"BOOKMARK":false,"CATEGORIES":"Asian","INGREDIENTS":["1 pound flank steak, thinly sliced","5 tablespoons soy sauce","2 1/2 tablespoons white sugar","1/4 cup chopped green onion","2 tablespoons minced garlic","2 tablespoons sesame seeds","2 tablespoons sesame oil","1/2 teaspoon ground black pepper"],"IMG_URL":"http://zipbanchan.godohosting.com/800X800px/cookingbox/800_beefbulkoki.jpg","CAPTION":"Beef Bulgogi","DIRECTIONS":["1. Place the beef in a shallow dish. Combine soy sauce, sugar, green onion, garlic, sesame seeds, sesame oil, and ground black pepper in a small bowl. Pour over beef. Cover and refrigerate for at least 1 hour or overnight.","2. Preheat an outdoor grill for high heat, and lightly oil the grate.","3. Quickly grill beef on hot grill until slightly charred and cooked through, 1 to 2 minutes per side."],"_locals":{}},{"BOOKMARK":false,"CATEGORIES":"Italian","INGREDIENTS":["¼ cup all-purpose flour for coating","½ teaspoon salt","¼ teaspoon ground black pepper","½ teaspoon dried oregano","4 skinless, boneless chicken breast halves - pounded 1/4 inch thick","4 tablespoons butter","4 tablespoons olive oil","1 cup sliced mushrooms","½ cup Marsala wine","¼ cup cooking sherry"],"IMG_URL":"https://www.thespruceeats.com/thmb/JnEwpZbEeY-sH_ysFmHHYOlYU9g=/2696x2696/smart/filters:no_upscale()/chicken-marsala-recipe-3052814-hero-01-ea70276549b84284a30efc558e09071f.jpg","CAPTION":"Chicken Marsala","DIRECTIONS":["placeholder","1. In a shallow dish or bowl, mix together the flour, salt, pepper and oregano. Coat chicken pieces in flour mixture.","2. In a large skillet, melt butter in oil over medium heat. Place chicken in the pan, and lightly brown. Turn over chicken pieces, and add mushrooms. Pour in wine and sherry. Cover skillet; simmer chicken 10 minutes, turning once, until no longer pink and juices run clear."],"_locals":{}},{"BOOKMARK":false,"CATEGORIES":"Mexican","INGREDIENTS":["6 cloves garlic, minced","2 tablespoons Korean chile paste (gochujang)","1 tablespoon soy sauce","2 teaspoons white sugar","1 teaspoon sesame oil","2 (10 ounce) cans chicken chunks, drained","4 (10 inch) flour tortillas","2 tablespoons vegetable oil","2 teaspoons butter, softened (optional)","1 cup fresh cilantro leaves","½ cup chopped kimchi, squeezed dry (optional)","2 tablespoons shredded sharp Cheddar cheese","1 tablespoon salsa"],"IMG_URL":"https://bishopsorchards.com/wp-content/uploads/2017/11/bigstock-Burritos-Wraps-With-Chicken-Me-117415919.jpg","CAPTION":"Chicken Burrito","DIRECTIONS":["1. Preheat oven to 360 degrees F (182 degrees C).","2. Stir garlic, chile paste, soy sauce, sugar, and sesame oil together in a bowl until the sugar dissolves into the liquid; add chicken and stir to coat.","3. Wrap tortillas in aluminum foil and bake in preheated oven until hot and soft, about 10 minutes.","4. While the tortillas warm, heat vegetable oil in a skillet. Cook and stir chicken in skillet until hot and the sauce has thickened, about 10 minutes.","5. Spread 1/2 teaspoon butter over one side of each warm tortilla. Divide chicken between the tortillas. Top chicken with equal portions of the cilantro, kimchi, Cheddar cheese, and salsa.","6. Fold opposing ends of each tortilla toward one another to partially cover the filling. Pull one remaining edge over the filling and then roll so the tortilla surrounds the filling completely."],"_locals":{}},{"BOOKMARK":false,"CATEGORIES":"Mexican","INGREDIENTS":["2 pounds ground beef","1/4 onion, finely chopped","1 cup shredded Cheddar cheese","1/2 cup sour cream","1 tablespoon dried parsley","1 tablespoon taco seasoning","1 teaspoon dried oregano","1/2 teaspoon ground black pepper","1 clove garlic, minced","1/2 teaspoon salt","8 flour tortillas","1 (15 ounce) can black beans, rinsed and drained","1 (4 ounce) can sliced black olives, drained","1/4 cup shredded Cheddar cheese"],"IMG_URL":"https://www.jessicagavin.com/wp-content/uploads/2018/04/chicken-enchiladas-5-1200.jpg","CAPTION":"Beef Enchiladas","DIRECTIONS":["1. Preheat oven to 350 degrees F (175 degrees C).","2. Cook and stir ground beef with onion in a skillet over medium heat until meat is crumbly and no longer pink, about 10 minutes. Drain grease. Stir 1 cup Cheddar cheese, sour cream, parsley, taco seasoning, oregano, and black pepper into the ground beef until cheese has melted. Mix in enchilada sauce, chili powder, garlic, and salt; bring to a simmer, reduce heat to low, and simmer until meat sauce is slightly thickened, about 5 minutes.","3. Lay a tortilla onto a work surface and spoon about 1/4 cup of meat sauce down the center of the tortilla. Top meat sauce with 1 tablespoon black beans and a sprinkling of black olives. Roll the tortilla up, enclosing the filling, and lay seam-side down into a 9x13-inch baking dish. Repeat with remaining tortillas. Spoon any remaining meat sauce over the enchiladas and scatter any remaining black beans and black olives over the top. Sprinkle tortillas with 1/4 cup Cheddar cheese.","4. Bake in the preheated oven until cheese topping is melted and enchiladas and sauce are bubbling, 20 to 22 minutes. Let stand 5 minutes before serving."],"_locals":{}},{"BOOKMARK":false,"CATEGORIES":"Asian","INGREDIENTS":["1 ½ cups water","2 tablespoons orange juice","¼ cup lemon juice","⅓ cup rice vinegar","2 ½ tablespoons soy sauce","1 tablespoon grated orange zest","1 cup packed brown sugar","½ teaspoon minced fresh ginger root","½ teaspoon minced garlic","2 tablespoons chopped green onion","¼ teaspoon red pepper flakes","3 tablespoons cornstarch","2 tablespoons water","2 boneless, skinless chicken breasts, cut into 1/2 inch pieces","1 cup all-purpose flour","¼ teaspoon salt","¼ teaspoon pepper","3 tablespoons olive oil"],"IMG_URL":"https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3864686.jpg&w=380&h=380&c=sc&poi=face&q=85","CAPTION":"Asian Orange Chicken","DIRECTIONS":["1. Pour 1 1/2 cups water, orange juice, lemon juice, rice vinegar, and soy sauce into a saucepan and set over medium-high heat. Stir in the orange zest, brown sugar, ginger, garlic, chopped onion, and red pepper flakes. Bring to a boil. Remove from heat, and cool 10 to 15 minutes.","2. Place the chicken pieces into a resealable plastic bag. When contents of saucepan have cooled, pour 1 cup of sauce into bag. Reserve the remaining sauce. Seal the bag, and refrigerate at least 2 hours.","3. In another resealable plastic bag, mix the flour, salt, and pepper. Add the marinated chicken pieces, seal the bag, and shake to coat.","4. Heat the olive oil in a large skillet over medium heat. Place chicken into the skillet, and brown on both sides. Drain on a plate lined with paper towels, and cover with aluminum foil.","5. Wipe out the skillet, and add the sauce. Bring to a boil over medium-high heat. Mix together the cornstarch and 2 tablespoons water; stir into the sauce. Reduce heat to medium low, add the chicken pieces, and simmer, about 5 minutes, stirring occasionally."],"_locals":{}}]